Repository: ahmedm-gh/oop
Catalog: lib/l10n/app_*.arb
Languages: ar

# qRenderingEngineBestUse
source: Benefit from engine improvements via Flutter upgrades. For advanced needs (e.g., custom shaders), learn how to use the appropriate engine.
ar: استفد من تحسينات المحرك عبر تحديثات Flutter. للاحتياجات المتقدمة (مثل shaders مخصصة)، تعلم كيفية استخدام المحرك المناسب.

# qFlutterVsReactNative
source: Compare Flutter with React Native: what are the pros and cons?
ar: قارن Flutter مع React Native: ما هي المميزات والعيوب؟

# qFlutterVsReactNativeNotes
source: Flutter and React Native are both cross-platform frameworks. Flutter compiles to native ARM code and has its own rendering, offering high performance. React Native uses a JavaScript bridge to native components, which can be slower. Flutter's UI is highly customizable, while React Native uses native widgets with less flexibility.
ar: Flutter و React Native كلاهما أطر عمل متعددة المنصات. Flutter يترجم لكود ARM أصلي وله رسوميات خاصة، مما يوفر أداءً عالياً. React Native يستخدم جسر JavaScript للمكونات الأصلية، مما قد يكون أبطأ. واجهة Flutter قابلة للتخصيص بشكل كبير، بينما React Native يستخدم widgets أصلية بمرونة أقل.

# qFlutterVsReactNativePros
source: Flutter: high performance, full UI control, one codebase. React Native: larger library ecosystem, JavaScript familiarity for web developers.
ar: Flutter: أداء عالٍ، تحكم كامل بالواجهة، قاعدة كود واحدة React Native: نظام مكتبات أكبر، JavaScript مألوف لمطوري الويب

# qFlutterVsReactNativeCons
source: Flutter: larger app size, Dart is less known, fewer third-party packages. React Native: performance overhead from JS bridge, UI consistency issues.
ar: Flutter: حجم تطبيق أكبر، Dart أقل شهرة، حزم طرف ثالث أقل React Native: عبء أداء من جسر JS، مشاكل في اتساق الواجهة

# qFlutterVsReactNativeBestUse
source: Use Flutter when performance and custom UI are top priorities. Use React Native if leveraging existing JavaScript code or ecosystem matters more.
ar: استخدم Flutter عندما يكون الأداء والواجهة المخصصة أولوية. استخدم React Native إذا كانت الاستفادة من كود JavaScript الموجود أو النظام البيئي أهم.

# qInheritanceVsComposition
source: Explain inheritance and composition in Dart.
ar: اشرح الوراثة (Inheritance) والتركيب (Composition) في Dart.

# qInheritanceVsCompositionNotes
source: Inheritance is when a class extends another class, inheriting its properties and methods ("is-a" relationship). Composition is when a class includes instances of other classes as fields ("has-a" relationship). Composition is often preferred for flexibility.
ar: الوراثة عندما يمتد class من class آخر، موروثاً خصائصه و methods (علاقة 'is-a'). التركيب عندما يتضمن class instances من classes أخرى كحقول (علاقة 'has-a'). التركيب غالباً مفضل للمرونة.

# qInheritanceVsCompositionPros
source: Inheritance makes code reuse easy for closely related classes. Composition provides more flexibility and looser coupling.
ar: الوراثة تسهل إعادة استخدام الكود للـ classes ذات الصلة القريبة التركيب يوفر مرونة أكبر وترابط أقل

# qInheritanceVsCompositionCons
source: Inheritance can lead to rigid hierarchies and tight coupling. Composition can lead to more boilerplate but is more adaptable.
ar: الوراثة قد تؤدي لتسلسلات جامدة وترابط شديد التركيب قد يؤدي لكود متكرر أكثر لكنه أكثر قابلية للتكيف

# qInheritanceVsCompositionBestUse
source: Use inheritance when classes have clear hierarchy and share behavior. Use composition to assemble behavior from multiple classes for flexibility.
ar: استخدم الوراثة عندما يكون للـ classes تسلسل واضح ويتشاركون سلوكاً. استخدم التركيب لتجميع السلوك من classes متعددة للمرونة.

# qWhatIsPolymorphism
source: What is polymorphism in object-oriented programming?
ar: ما هو تعدد الأشكال (Polymorphism) في البرمجة الكائنية؟

# qWhatIsPolymorphismNotes
source: Polymorphism means "many forms". In Dart, it allows treating objects of different classes through a common interface (e.g., methods overridden in subclasses). A function can accept a base class type and operate on any subclass instance.
ar: تعدد الأشكال يعني 'أشكال متعددة'. في Dart، يسمح بمعاملة كائنات من classes مختلفة عبر واجهة مشتركة (مثل methods مُعاد تعريفها في subclasses). دالة يمكن أن تقبل نوع class أساسي وتعمل على أي instance من subclass.

# qWhatIsPolymorphismPros
source: Makes code more flexible and reusable by programming to an interface or superclass rather than concrete classes.
ar: يجعل الكود أكثر مرونة وقابلية لإعادة الاستخدام بالبرمجة لواجهة أو superclass بدلاً من classes محددة

# qWhatIsPolymorphismCons
source: May make code harder to understand if overused, as the actual object type is less obvious.
ar: قد يجعل الكود أصعب في الفهم إذا أُفرط في استخدامه، لأن نوع الكائن الفعلي أقل وضوحاً

# qWhatIsPolymorphismBestUse
source: Use polymorphism when you want to use a common interface (abstract class or base class) for different concrete implementations.
ar: استخدم تعدد الأشكال عندما تريد استخدام واجهة مشتركة (abstract class أو base class) لتطبيقات محددة مختلفة.

# search
source: Search questions...
ar: ابحث في الأسئلة...

# noResults
source: No results found
ar: لا توجد نتائج

source: All
ar: الكل

source: Code Example
ar: مثال كود

source: Programming Terms
ar: مصطلحات برمجية

source: Useful Pub Packages
ar: مكتبات مفيدة

source: Tags
ar: الوسوم

source: Theoretical
ar: نظري

source: Practical
ar: تطبيقي

# cBasic
source: Basic
ar: أساسي

# cSecurity
source: Security
ar: أمان

# cOOP
source: OOP
ar: برمجة كائنية

# cSolid
source: SOLID
ar: صلب

# cDesignPatterns
source: Design Patterns
ar: أنماط التصميم

# cDataStructures
source: Data Structures
ar: هياكل البيانات

# cStateManagement
source: State Management
ar: إدارة الحالة

# cPerformance
source: Performance
ar: أداء

# cTesting
source: Testing
ar: اختبار

# cNetworking
source: Networking
ar: شبكات

# cDatabase
source: Database
ar: قاعدة بيانات

# cArchitecture
source: Architecture
ar: هندسة معمارية

# cDartBasics
source: Dart Basics
ar: أساسيات دارت

# cFlutterBasics
source: Flutter Basics
ar: أساسيات فلاتر

# cUI
source: UI
ar: واجهة المستخدم

# cNativePlatform
source: Native Platform
ar: منصة أصلية

# cAnimations
source: Animations
ar: رسوم متحركة

# cModernFeatures
source: Modern Features
ar: ميزات حديثة

# cDeployment
source: Deployment
ar: النشر

source: Question not found
ar: السؤال غير موجود

source: Only Bookmarked
ar: فقط المحفوظة

source: All Levels
ar: جميع المستويات

source: Common Mistakes
ar: الأخطاء الشائعة

source: No pattern
ar: لا يوجد نمط

# pGoF
source: Classic (GoF)
ar: الكلاسيكية (GoF)

# pNonGoF
source: Non-GoF
ar: غير مدرجة ضمن GoF

# pPractical
source: Practical
ar: نمط عملي

# pModern
source: Modern
ar: نمط حديث

# designPattern
source: Design Patterns
ar: نمط تصميم

# architecturalPattern
source: Architectural Patterns
ar: نمط معماري

# stateManagementPattern
source: State Management Patterns
ar: نمط إدارة الحالة

# uiPattern
source: UI Patterns
ar: نمط واجهة المستخدم (UI)

# projectStructurePattern
source: Project Structure Patterns
ar: نمط هيكلة المشروع

# creationalPattern
source: Creational Patterns
ar: نمط الإنشاء (Creational)

# structuralPattern
source: Structural Patterns
ar: نمط التركيب (Structural)

# behavioralPattern
source: Behavioral Patterns
ar: نمط السلوك (Behavioral)

source: Related Patterns
ar: أنماط متعلقة

source: Often Confused With
ar: غالباً ما يخطلت الأمر مع
