Repository: ahmedm-gh/oop
Catalog: lib/l10n/app_*.arb
Languages: ar

# qWidgetLifecycleNotes
source: A StatefulWidget has a State object whose lifecycle includes initState(), didChangeDependencies(), build(), setState(), deactivate(), dispose(), and reassemble (during hot reload). initState is called once when the widget is inserted into the widget tree; build() is called often to redraw; dispose() is called when the widget is removed.
ar: StatefulWidget لديه كائن State تتضمن دورة حياته initState()، didChangeDependencies()، build()، setState()، deactivate()، dispose()، و reassemble (أثناء hot reload). يُستدعى initState مرة واحدة عند إدراج الـ widget في الشجرة؛ build() يُستدعى كثيراً لإعادة الرسم؛ dispose() يُستدعى عند إزالة الـ widget.

# qWidgetLifecyclePros
source: Understanding lifecycle is crucial for resource management (e.g., initializing and disposing controllers) and for controlling rebuilds.
ar: فهم دورة الحياة ضروري لإدارة الموارد (مثل تهيئة والتخلص من Controllers) والتحكم في إعادة البناء

# qWidgetLifecycleCons
source: Managing complex lifecycles can be error-prone. Forgetting to dispose can cause memory leaks.
ar: إدارة دورات الحياة المعقدة قد تكون عرضة للأخطاء نسيان dispose يمكن أن يسبب تسرب ذاكرة (Memory Leaks)

# qWidgetLifecycleBestUse
source: Use initState for one-time initialization, build to construct the UI, and dispose to clean up resources like animations or streams.
ar: استخدم initState للتهيئة لمرة واحدة، build لبناء الواجهة، و dispose لتنظيف الموارد مثل الرسوم المتحركة أو الـ Streams.

# qWhatAreMixins
source: What are mixins in Dart and how are they used?
ar: ما هي الـ Mixins في Dart وكيف تُستخدم؟

# qWhatAreMixinsNotes
source: Mixins allow a class to use methods and properties from multiple classes without multiple inheritance. In Dart, you define a mixin with the 'mixin' keyword and then use it with the 'with' keyword in a class declaration. They are useful for code reuse.
ar: الـ Mixins تسمح للـ class باستخدام methods وخصائص من classes متعددة دون الوراثة المتعددة. في Dart، تعرّف mixin بكلمة 'mixin' ثم تستخدمه بكلمة 'with' في تعريف الـ class. مفيدة لإعادة استخدام الكود.

# qWhatAreMixinsPros
source: Provide a way to add common functionality to multiple classes without forcing an inheritance relationship. They keep classes more modular.
ar: توفر طريقة لإضافة وظائف مشتركة لـ classes متعددة دون فرض علاقة وراثة تبقي الـ Classes أكثر وحدوية

# qWhatAreMixinsCons
source: Overusing mixins can lead to complex hierarchies and unexpected behavior if many mixins modify similar properties.
ar: الإفراط في استخدام الـ Mixins قد يؤدي لتسلسلات معقدة وسلوك غير متوقع إذا عدلت عدة mixins نفس الخصائص

# qWhatAreMixinsBestUse
source: Use mixins when you want to share functionality (like logging, validation, etc.) across different classes without creating a base class.
ar: استخدم الـ Mixins عندما تريد مشاركة وظائف (مثل التسجيل، التحقق، إلخ) عبر classes مختلفة دون إنشاء class أساسي.

# qExtensionMethods
source: What are extension methods in Dart?
ar: ما هي Extension Methods في Dart؟

# qExtensionMethodsNotes
source: Extension methods allow you to add new methods (or getters/setters) to existing libraries or classes without modifying them. Defined using the 'extension' keyword, they are a syntactic convenience to extend functionality.
ar: Extension Methods تسمح لك بإضافة methods جديدة (أو getters/setters) للمكتبات أو الـ classes الموجودة دون تعديلها. تُعرّف باستخدام كلمة 'extension'، وهي سهولة نحوية لتوسيع الوظائف.

# qExtensionMethodsPros
source: Enable cleaner code by extending functionality of built-in types or classes (e.g., adding utility methods to String).
ar: تمكن من كتابة كود أنظف بتوسيع وظائف الأنواع المدمجة أو الـ classes (مثل إضافة methods مساعدة لـ String)

# qExtensionMethodsCons
source: They can make code harder to discover, as methods are not visible on the original class definition.
ar: يمكن أن تجعل الكود أصعب في الاكتشاف، لأن الـ methods غير مرئية في تعريف الـ class الأصلي

# qExtensionMethodsBestUse
source: Use extension methods to add helper functions to types in your project without creating utility classes.
ar: استخدم extension methods لإضافة دوال مساعدة للأنواع في مشروعك دون إنشاء utility classes.

# qListsSetsMaps
source: What are Lists, Sets, and Maps in Dart and when to use each?
ar: ما هي Lists و Sets و Maps في Dart ومتى تستخدم كلاً منها؟

# qListsSetsMapsNotes
source: List is an ordered collection allowing duplicates; use when order matters. Set is an unordered collection of unique items; use when you need uniqueness. Map is a key-value store; use when you need to associate values with keys for fast lookup.
ar: List هي مجموعة مرتبة تسمح بالتكرار؛ استخدمها عندما يهم الترتيب. Set هي مجموعة غير مرتبة من العناصر الفريدة؛ استخدمها عندما تحتاج التفرد. Map هي مخزن key-value؛ استخدمها عندما تحتاج لربط قيم بمفاتيح للبحث السريع.

# qListsSetsMapsProsPros
source: Lists allow indexed access and ordering. Sets ensure no duplicates and provide fast membership checks. Maps provide fast key-based lookup.
ar: Lists تسمح بالوصول بالفهرس والترتيب Sets تضمن عدم التكرار وتوفر فحص عضوية سريع Maps توفر بحث سريع بالمفتاح

# qListsSetsMapsProsCons
source: Lists may be inefficient if you need to enforce uniqueness. Sets do not maintain insertion order. Maps use more memory per entry than a simple list.
ar: Lists قد تكون غير فعالة إذا كنت بحاجة لفرض التفرد Sets لا تحافظ على ترتيب الإدراج Maps تستخدم ذاكرة أكثر لكل عنصر من list بسيطة

# qListsSetsMapsProsBestUse
source: Use List for ordered data sequences, Set for unique collections, and Map for key-value associations.
ar: استخدم List لتسلسلات البيانات المرتبة، Set للمجموعات الفريدة، و Map لارتباطات key-value.

# qSolidPrinciples
source: What are the SOLID principles and how do they apply in Flutter?
ar: ما هي مبادئ SOLID وكيف تنطبق على Flutter؟

# qSolidPrinciplesNotes
source: SOLID refers to five principles of object-oriented design: Single Responsibility, Open/Closed, Liskov Substitution, Interface Segregation, and Dependency Inversion. In Flutter, keep widgets/controllers with a single responsibility, use abstractions for dependencies, and make classes open for extension but closed for modification.
ar: SOLID تشير لخمسة مبادئ في التصميم الكائني: المسؤولية الواحدة، المفتوح/المغلق، استبدال Liskov، فصل الواجهات، وعكس التبعية. في Flutter، احتفظ بـ widgets/controllers بمسؤولية واحدة، استخدم التجريدات للتبعيات، واجعل الـ classes مفتوحة للتوسعة لكن مغلقة للتعديل.

# qSolidPrinciplesPros
source: Following SOLID makes code more maintainable, testable, and extensible. For Flutter, it encourages clean separation of UI and logic.
ar: اتباع SOLID يجعل الكود أكثر قابلية للصيانة والاختبار والتوسعة لـ Flutter، يشجع الفصل النظيف بين الواجهة والمنطق

# qSolidPrinciplesCons
source: Strict adherence can lead to more abstraction and boilerplate. It may complicate simple projects if overdone.
ar: الالتزام الصارم قد يؤدي لمزيد من التجريد والكود المتكرر قد يعقد المشاريع البسيطة إذا بولغ فيه

# qSolidPrinciplesBestUse
source: Use SOLID to structure larger Flutter apps; start simple but refactor towards SOLID as complexity grows.
ar: استخدم SOLID لهيكلة تطبيقات Flutter الأكبر؛ ابدأ بسيطاً لكن أعد الهيكلة نحو SOLID مع نمو التعقيد.

# qBlocPattern
source: What is the BLoC pattern in Flutter?
ar: ما هو نمط BLoC في Flutter؟

# qBlocPatternNotes
source: BLoC (Business Logic Component) is an architectural pattern that separates business logic from UI by using Streams. BLoC exposes streams of data, and UI widgets listen to them. This makes the code more testable and reusable.
ar: BLoC (Business Logic Component) هو نمط معماري يفصل منطق الأعمال عن الواجهة باستخدام Streams. BLoC يكشف streams من البيانات، وwidgets الواجهة تستمع إليها. هذا يجعل الكود أكثر قابلية للاختبار وإعادة الاستخدام.

# qBlocPatternPros
source: Promotes separation of concerns and testability. Works well with reactive programming. Simplifies state management for complex apps.
ar: يعزز فصل الاهتمامات وقابلية الاختبار يعمل جيداً مع البرمجة التفاعلية (Reactive Programming) يبسط إدارة الحالة للتطبيقات المعقدة

# qBlocPatternCons
source: Adds boilerplate (stream controllers, sinks, etc.). Can be overkill for simple apps. Learning curve is higher than simple setState.
ar: يضيف كوداً متكرراً (stream controllers، sinks، إلخ) قد يكون مبالغاً فيه للتطبيقات البسيطة منحنى التعلم أعلى من setState البسيط

# qBlocPatternBestUse
source: Use BLoC for medium to large apps where separation of logic is beneficial. For smaller apps, simpler methods may suffice.
ar: استخدم BLoC للتطبيقات المتوسطة والكبيرة حيث يكون فصل المنطق مفيداً. للتطبيقات الأصغر، قد تكفي طرق أبسط.

# qProviderVsBloc
source: What is Provider in Flutter and how does it differ from BLoC?
ar: ما هو Provider في Flutter وكيف يختلف عن BLoC؟

# qProviderVsBlocNotes
source: Provider is a wrapper around InheritedWidget that makes state management easier by providing and accessing state objects. Unlike BLoC (which uses Streams), Provider often uses ChangeNotifier or simple objects. Provider simplifies passing data down the widget tree.
ar: Provider هو غلاف حول InheritedWidget يسهل إدارة الحالة بتوفير والوصول لكائنات الحالة. بعكس BLoC (الذي يستخدم Streams)، Provider غالباً يستخدم ChangeNotifier أو كائنات بسيطة. Provider يبسط تمرير البيانات عبر شجرة الـ widgets.

# qProviderVsBlocPros
source: Lightweight and easy to use. Less boilerplate than BLoC. Well-integrated with Flutter.
ar: خفيف وسهل الاستخدام كود أقل من BLoC متكامل جيداً مع Flutter

# qProviderVsBlocCons
source: Does not enforce a strict pattern, which can lead to scattered state logic if not organized. Less formal separation than BLoC.
ar: لا يفرض نمطاً صارماً، مما قد يؤدي لمنطق حالة متفرق إذا لم يُنظم فصل أقل رسمية من BLoC

# qProviderVsBlocBestUse
source: Use Provider for simpler state management needs or smaller apps. It integrates well with Flutter and is easier to start with than BLoC.
ar: استخدم Provider لاحتياجات إدارة حالة أبسط أو تطبيقات أصغر. يتكامل جيداً مع Flutter وأسهل للبدء من BLoC.

# qFutureVsStream
source: What is the difference between Future and Stream in Dart?
ar: ما الفرق بين Future و Stream في Dart؟

# qFutureVsStreamNotes
source: A Future represents a single asynchronous computation that either completes with a value or an error. A Stream represents a sequence of asynchronous events or data over time. FutureBuilder is used for one-time async results, StreamBuilder for ongoing data streams.
ar: Future يمثل عملية حسابية غير متزامنة واحدة تكتمل بقيمة أو خطأ. Stream يمثل تسلسل من الأحداث أو البيانات غير المتزامنة عبر الوقت. FutureBuilder يُستخدم لنتائج async لمرة واحدة، StreamBuilder لتدفقات البيانات المستمرة.

# qFutureVsStreamPros
source: Use Future for single HTTP requests or quick async tasks. Use Stream for events like WebSocket messages, sensor data, or periodic updates.
ar: استخدم Future لطلبات HTTP المفردة أو المهام async السريعة استخدم Stream للأحداث مثل رسائل WebSocket، بيانات الحساسات، أو التحديثات الدورية

# qFutureVsStreamCons
source: Future cannot handle multiple values or continuous updates. Streams introduce more complexity (listeners, cancellations).
ar: Future لا يمكنه التعامل مع قيم متعددة أو تحديثات مستمرة Streams تضيف تعقيداً أكثر (المستمعين، الإلغاءات)

# qFutureVsStreamBestUse
source: Use Future when expecting a single result. Use Stream when listening for multiple results or changes over time.
ar: استخدم Future عند توقع نتيجة واحدة. استخدم Stream عند الاستماع لنتائج متعددة أو تغييرات عبر الوقت.

# qNavigationPushReplace
source: How do you navigate between screens in Flutter? (push, pushReplacement)
ar: كيف تتنقل بين الشاشات في Flutter؟ (push، pushReplacement)

# qNavigationPushReplaceNotes
source: Navigation in Flutter uses the Navigator widget. Navigator.push adds a route to the stack (user can press back to return). Navigator.pushReplacement replaces the current route with a new one, removing the previous from the stack.
ar: التنقل في Flutter يستخدم Navigator widget. Navigator.push يضيف route للمكدس (المستخدم يمكنه الضغط على رجوع للعودة). Navigator.pushReplacement يستبدل الـ route الحالي بجديد، مزيلاً السابق من المكدس.

# qNavigationPushReplacePros
source: push keeps the previous screen in memory (user can go back). pushReplacement removes it (suitable for login screens or flows where going back is not needed).
ar: push يحتفظ بالشاشة السابقة في الذاكرة (المستخدم يمكنه العودة) pushReplacement يزيلها (مناسب لشاشات تسجيل الدخول أو التدفقات التي لا تحتاج العودة)

# qNavigationPushReplaceCons
source: push can accumulate many routes if not managed (memory). pushReplacement prevents back navigation but loses previous screen state.
ar: push قد يراكم routes كثيرة إذا لم يُدار (الذاكرة) pushReplacement يمنع التنقل للخلف لكن يفقد حالة الشاشة السابقة

# qNavigationPushReplaceBestUse
source: Use push for normal forward navigation. Use pushReplacement for replacing screens permanently (e.g., after login or splash screen).
ar: استخدم push للتنقل للأمام العادي. استخدم pushReplacement لاستبدال الشاشات بشكل دائم (مثل بعد تسجيل الدخول أو شاشة البداية).

# qNavigator1Vs2
source: What is the difference between Navigator 1.0 and Navigator 2.0?
ar: ما الفرق بين Navigator 1.0 و Navigator 2.0؟

# qNavigator1Vs2Notes
source: Navigator 1.0 is the classic imperative API (push/pop by widget), while Navigator 2.0 is a declarative, URL-based API with Router and RouteInformationParser. Navigator 2.0 offers more control over browser URL and deep linking.
ar: Navigator 1.0 هو API الأمري الكلاسيكي (push/pop بواسطة widget)، بينما Navigator 2.0 هو API تصريحي قائم على URL مع Router و RouteInformationParser. Navigator 2.0 يوفر تحكماً أكبر في URL المتصفح والروابط العميقة.

# qNavigator1Vs2Pros
source: Navigator 2.0 enables web and more complex navigation patterns (deep linking).
ar: Navigator 2.0 يمكّن أنماط تنقل الويب والأكثر تعقيداً (الروابط العميقة)

# qNavigator1Vs2Cons
source: Navigator 2.0 has a steeper learning curve and more code overhead. For simple apps, Navigator 1.0 is easier to use.
ar: Navigator 2.0 له منحنى تعلم أعلى وكود أكثر للتطبيقات البسيطة، Navigator 1.0 أسهل

# qNavigator1Vs2BestUse
source: Use Navigator 2.0 for web apps or apps requiring deep linking and custom routing behavior. For basic navigation, 1.0 is sufficient.
ar: استخدم Navigator 2.0 لتطبيقات الويب أو التطبيقات التي تتطلب روابط عميقة وسلوك توجيه مخصص. للتنقل الأساسي، 1.0 كافٍ.

# qBuildContext
source: What is Flutter's build() method context parameter?
ar: ما هو معامل context في method الـ build() في Flutter؟

# qBuildContextNotes
source: BuildContext is an object which represents the location of a widget in the widget tree. It is passed to the build method and can be used to access theme data, localization, and to find ancestor widgets in the tree.
ar: BuildContext هو كائن يمثل موقع widget في شجرة الـ widgets. يُمرر لـ method الـ build ويمكن استخدامه للوصول لبيانات الثيم والترجمة وللعثور على widgets الأسلاف في الشجرة.

# qBuildContextPros
source: Allows widgets to access inherited widgets like Theme or MediaQuery. Essential for widget communication.
ar: يسمح للـ widgets بالوصول للـ inherited widgets مثل Theme أو MediaQuery ضروري للتواصل بين الـ widgets

# qBuildContextCons
source: Misusing context (e.g., using it before initState or in async) can lead to errors.
ar: إساءة استخدام context (مثل استخدامه قبل initState أو في async) قد يؤدي لأخطاء

# qBuildContextBestUse
source: Use context inside build() to obtain theme or other inherited data, or Navigator for navigation.
ar: استخدم context داخل build() للحصول على الثيم أو بيانات موروثة أخرى، أو Navigator للتنقل.

# qWhatIsIsolate
source: What is an Isolate in Dart and how is it used?
ar: ما هو الـ Isolate في Dart وكيف يُستخدم؟

# qWhatIsIsolateNotes
source: An Isolate is a separate thread of execution that doesn't share memory with the main isolate. It has its own memory heap. Communication is done via message passing (SendPort/ReceivePort). Use isolates for CPU-intensive tasks to avoid blocking the main UI thread.
ar: Isolate هو خيط تنفيذ منفصل لا يشارك الذاكرة مع الـ isolate الرئيسي. له heap ذاكرة خاص به. الاتصال يتم عبر تمرير الرسائل (SendPort/ReceivePort). استخدم isolates للمهام المكثفة للـ CPU لتجنب حجب خيط الواجهة الرئيسي.

# qWhatIsIsolatePros
source: Enables true parallel computation in Dart without shared-memory concurrency bugs. Improves performance for heavy tasks.
ar: يمكّن الحوسبة المتوازية الحقيقية في Dart بدون أخطاء التزامن للذاكرة المشتركة يحسن الأداء للمهام الثقيلة

# qWhatIsIsolateCons
source: Communication via message passing can be complex and slower. Starting an isolate has overhead; not suitable for small tasks.
ar: الاتصال عبر تمرير الرسائل قد يكون معقداً وأبطأ بدء isolate له تكلفة؛ غير مناسب للمهام الصغيرة

# qWhatIsIsolateBestUse
source: Use isolates for expensive computations (image processing, large computations) off the main thread. For most UI tasks, use async/await instead.
ar: استخدم isolates للحسابات المكلفة (معالجة الصور، الحسابات الكبيرة) بعيداً عن الخيط الرئيسي. لمعظم مهام الواجهة، استخدم async/await بدلاً.

# qFutureBuilderStreamBuilder
source: What are FutureBuilder and StreamBuilder used for in Flutter?
ar: ما هو FutureBuilder و StreamBuilder ولماذا يُستخدمان في Flutter؟

# qFutureBuilderStreamBuilderNotes
source: FutureBuilder is a widget that builds itself based on the latest snapshot of interaction with a Future. StreamBuilder similarly rebuilds when new Stream events arrive. They simplify handling of asynchronous data in the UI without manual listeners.
ar: FutureBuilder هو widget يبني نفسه بناءً على آخر snapshot من التفاعل مع Future. StreamBuilder يعيد البناء بالمثل عند وصول أحداث Stream جديدة. يبسطان التعامل مع البيانات غير المتزامنة في الواجهة بدون مستمعين يدويين.

# qFutureBuilderStreamBuilderPros
source: Makes it easy to update UI based on async results or stream data. Handles connection states and snapshots automatically.
ar: يسهل تحديث الواجهة بناءً على نتائج async أو بيانات stream يتعامل مع حالات الاتصال والـ snapshots تلقائياً

# qFutureBuilderStreamBuilderCons
source: Can lead to rebuilds on every event. Need to manage performance if streams are frequent.
ar: قد يؤدي لإعادة بناء عند كل حدث تحتاج لإدارة الأداء إذا كانت الـ streams متكررة

# qFutureBuilderStreamBuilderBestUse
source: Use FutureBuilder for one-time async calls (like HTTP requests) and StreamBuilder for continuous data (like realtime updates or web sockets).
ar: استخدم FutureBuilder لنداءات async لمرة واحدة (مثل طلبات HTTP) و StreamBuilder للبيانات المستمرة (مثل التحديثات الفورية أو web sockets).

# qConstructorFactory
source: What is a Constructor in Dart and what are factory constructors?
ar: ما هو الـ Constructor في Dart وما هي factory constructors؟

# qConstructorFactoryNotes
source: A constructor in Dart is a special method to create objects of a class. A factory constructor is a special type of constructor that can return an existing instance or a subclass. It's declared with the 'factory' keyword. Useful for singleton or cache implementations.
ar: Constructor في Dart هو method خاص لإنشاء كائنات من class. Factory constructor هو نوع خاص من الـ constructor يمكن أن يعيد instance موجود أو subclass. يُعلن عنه بكلمة 'factory'. مفيد لتطبيقات singleton أو cache.

# qConstructorFactoryPros
source: Factory constructors allow control over instance creation (e.g., implementing singletons or caches). Can return different subtypes.
ar: Factory constructors تسمح بالتحكم في إنشاء الـ instance (مثل تطبيق singletons أو caches) يمكن إرجاع أنواع فرعية مختلفة

# qConstructorFactoryCons
source: Factory constructors cannot access 'this' and don't automatically create a new instance. They add complexity compared to a normal constructor.
ar: Factory constructors لا يمكنها الوصول لـ 'this' ولا تنشئ instance جديد تلقائياً تضيف تعقيداً مقارنة بـ constructor عادي

# qConstructorFactoryBestUse
source: Use factory constructors for patterns like singleton or when you need custom logic to decide which instance to return.
ar: استخدم factory constructors لأنماط مثل singleton أو عندما تحتاج لمنطق مخصص لتحديد أي instance تعيده.

# qSingletonPattern
source: What is a Singleton pattern and how can you implement it in Dart?
ar: ما هو نمط Singleton وكيف يمكنك تطبيقه في Dart؟

# qSingletonPatternNotes
source: Singleton ensures a class has only one instance and provides a global access point. In Dart, you can implement a singleton by using a private constructor and a static instance. Useful for caches or shared resources.
ar: Singleton يضمن أن class له instance واحد فقط ويوفر نقطة وصول عامة. في Dart، يمكنك تطبيق singleton باستخدام constructor خاص و instance ثابت. مفيد للـ caches أو الموارد المشتركة.

# qSingletonPatternPros
source: Ensures a single shared instance across the app (useful for caches, shared resources).
ar: يضمن instance مشترك واحد عبر التطبيق (مفيد للـ caches، الموارد المشتركة)

# qSingletonPatternCons
source: Global state can make testing harder and lead to hidden dependencies.
ar: الحالة العامة قد تصعب الاختبار وتؤدي لتبعيات مخفية

# qSingletonPatternBestUse
source: Use singleton for classes that manage global state or resources (e.g., a settings manager or network client).
ar: استخدم singleton للـ classes التي تدير حالة أو موارد عامة (مثل مدير الإعدادات أو عميل الشبكة).

# qFlutterPerformance
source: How do you optimize Flutter application performance?
ar: كيف تحسّن أداء تطبيق Flutter؟

# qFlutterPerformanceNotes
source: Common Flutter performance optimizations include: using const constructors to avoid rebuilds, splitting widgets to reduce rebuild scope, using efficient data structures, minimizing widget layers (RepaintBoundary), and caching images or data. Avoid large asset sizes and excessive rebuilds.
ar: تحسينات أداء Flutter الشائعة تشمل: استخدام const constructors لتجنب إعادة البناء، تقسيم الـ widgets لتقليل نطاق إعادة البناء، استخدام هياكل بيانات فعالة، تقليل طبقات الـ widgets (RepaintBoundary)، وتخزين الصور أو البيانات مؤقتاً. تجنب أحجام الأصول الكبيرة وإعادة البناء المفرطة.

# qFlutterPerformancePros
source: Applying these techniques can significantly improve frame rates and responsiveness.
ar: تطبيق هذه التقنيات يمكن أن يحسن معدلات الإطارات والاستجابة بشكل كبير

# qFlutterPerformanceCons
source: Over-optimizing early can complicate code. Focus on bottlenecks identified by profiling.
ar: التحسين المبكر المفرط قد يعقد الكود ركز على الاختناقات المحددة بالتحليل (Profiling)

# qFlutterPerformanceBestUse
source: Use performance profiling (DevTools) to find bottlenecks. Apply optimizations like const constructors, efficient layout, and offloading work to isolates as needed.
ar: استخدم تحليل الأداء (DevTools) للعثور على الاختناقات. طبق التحسينات مثل const constructors، التخطيط الفعال، ونقل العمل للـ isolates حسب الحاجة.

# qRenderingEngine
source: What is Flutter's rendering engine and how does it work (e.g., Skia, Impeller)?
ar: ما هو محرك الرسوميات في Flutter وكيف يعمل (مثل Skia، Impeller)؟

# qRenderingEngineNotes
source: Flutter's default rendering engine is Skia, a C++ based 2D graphics library. The newer Impeller engine improves performance and reduces graphical issues on some platforms. These engines compile Flutter's UI to native graphics commands on each platform.
ar: محرك الرسوميات الافتراضي في Flutter هو Skia، مكتبة رسوميات ثنائية الأبعاد بلغة C++. محرك Impeller الأحدث يحسن الأداء ويقلل المشاكل الرسومية على بعض المنصات. هذه المحركات تترجم واجهة Flutter لأوامر رسوميات أصلية على كل منصة.

# qRenderingEnginePros
source: Skia provides high-quality, fast rendering. Impeller further optimizes GPU use and predictability.
ar: Skia يوفر رسوميات عالية الجودة وسريعة Impeller يحسن استخدام GPU والقابلية للتنبؤ

# qRenderingEngineCons
source: Engine details are mostly abstracted away. Developers should be aware for debugging only. Impeller is still maturing on some platforms.
ar: تفاصيل المحرك مجردة في الغالب يجب على المطورين معرفتها للتصحيح فقط Impeller لا يزال ينضج على بعض المنصات
