Repository: ahmedm-gh/oop
Catalog: lib/l10n/app_*.arb
Languages: ar

# proxyPros
source: Control the service object without clients knowing about it. Manage life cycle of the service object. Works even if the service object isn't ready or is not available.
ar: التحكم في كائن الخدمة دون علم المستخدمين (Clients) إدارة دورة حياة كائن الخدمة (Life Cycle Management) يعمل حتى لو لم يكن كائن الخدمة جاهزاً أو متاحاً بعد

# proxyCons
source: The code may become more complicated since you need to introduce a lot of new classes. The response from the service might be delayed.
ar: قد يزيد من تعقيد الكود بسبب إضافة كلاسات جديدة قد يتأخر الرد من الخدمة بسبب الطبقة الإضافية

# proxyWhenToUse
source: Use for Lazy initialization (virtual proxy), Access control (protection proxy), or Logging requests (logging proxy).
ar: استخدمه للتحميل الكسول (Lazy Loading/Virtual Proxy)، التحكم في الصلاحيات (Access Control/Protection Proxy)، أو تسجيل الطلبات (Logging Proxy).

# proxyBestUse
source: Caching, Access Control, Lazy Loading, or Remote Service Proxy.
ar: التخزين المؤقت (Caching)، التحكم في الوصول (Access Control)، التحميل البطيء (Lazy Loading)، أو الوصول لخدمات بعيدة (Remote Service Proxy).

# observerPros
source: Open/Closed Principle. Establish relations between objects at runtime.
ar: مبدأ المفتوح/المغلق إنشاء علاقات بين الكائنات أثناء التشغيل (Runtime) بشكل ديناميكي

# observerCons
source: Subscribers are notified in random order.
ar: يتم إخطار المشتركين (Subscribers) بترتيب عشوائي وغير محدد

# observerWhenToUse
source: Use when changes to the state of one object may require changing other objects, and the actual set of objects is unknown beforehand or changes dynamically.
ar: استخدمه عندما تحتاج لإخطار عدة كائنات تلقائياً عند حدوث تغيير في كائن معين، خصوصاً عندما لا تعرف مسبقاً عدد أو نوع الكائنات التي ستحتاج للإخطار.

# observerBestUse
source: Event handling systems, UI updates in response to state changes (Streams/Notifiers), or Stock market trackers.
ar: أنظمة معالجة الأحداث (Event Handling)، تحديث واجهة المستخدم عند تغير البيانات (UI Updates with Streams/Notifiers)، أو تطبيقات تتبع الأسهم.

# strategyPros
source: Swap algorithms used inside an object at runtime. Isolate implementation details of an algorithm from code that uses it. Open/Closed Principle.
ar: تبديل الخوارزميات أثناء التشغيل (Runtime) بسهولة عزل تفاصيل تنفيذ الخوارزمية عن الكود الذي يستخدمها مبدأ المفتوح/المغلق

# strategyCons
source: If you only have a couple of algorithms and they rarely change, no real reason to over-complicate the program with new classes.
ar: إذا كان لديك خوارزميتان فقط ونادراً ما تتغيران، فلا داعي لتعقيد البرنامج بكلاسات جديدة

# strategyWhenToUse
source: Use when you want to use different variants of an algorithm within an object and be able to switch from one algorithm to another during runtime.
ar: استخدمه عندما تريد استخدام أشكال مختلفة من خوارزمية معينة داخل كائن، والقدرة على التبديل بينها أثناء تشغيل البرنامج.

# strategyBestUse
source: Payment methods, Sorting algorithms, Route planning, or Compression styles.
ar: طرق الدفع المختلفة (Payment Methods)، خوارزميات الترتيب (Sorting Algorithms)، تخطيط المسار (Route Planning)، أو أنواع الضغط المختلفة (Compression).

# commandPros
source: Single Responsibility Principle. Open/Closed Principle. Implement undo/redo. Implement deferred execution.
ar: مبدأ المسؤولية الواحدة مبدأ المفتوح/المغلق تنفيذ Undo/Redo بسهولة تأجيل تنفيذ العمليات أو جدولتها (Deferred Execution)

# commandCons
source: Code may become more complicated since you introduce a whole new layer between senders and receivers.
ar: يزيد من تعقيد الكود بسبب إضافة طبقة كاملة جديدة بين المُرسل (Sender) والمُستقبِل (Receiver)

# commandWhenToUse
source: Use when you want to parametrize objects with operations or queue/schedule their execution.
ar: استخدمه عندما تريد تحويل العمليات إلى كائنات يمكن تمريرها وتخزينها، أو جدولة تنفيذها لاحقاً.

# commandBestUse
source: GUI button actions, Undo/Redo systems, Task queues, or Transaction logs.
ar: أزرار واجهة المستخدم (GUI Buttons)، أنظمة Undo/Redo، قوائم انتظار المهام (Task Queues)، أو تسجيل المعاملات (Transaction Logs).

# statePros
source: Single Responsibility Principle. Open/Closed Principle. Simplify state-dependent code (eliminate massive switch/if-else).
ar: مبدأ المسؤولية الواحدة مبدأ المفتوح/المغلق تبسيط الكود المعقد المعتمد على الحالة (التخلص من switch/if-else الضخمة)

# stateCons
source: Applying the pattern can be overkill if a state machine has only a few states or rarely changes.
ar: قد يكون مبالغاً فيه إذا كانت لديك حالات قليلة فقط أو نادراً ما تتغير

# stateWhenToUse
source: Use when you have an object that behaves differently depending on its current state, the number of states is enormous, and the state-specific code changes frequently.
ar: استخدمه عندما يكون لديك كائن يتصرف بشكل مختلف تماماً اعتماداً على حالته الحالية، والحالات كثيرة، والكود الخاص بكل حالة يتغير بشكل متكرر.

# stateBestUse
source: Vending machines, Game character behaviors, Order processing, or Media players.
ar: آلات البيع الذاتي (Vending Machines)، سلوكيات شخصيات الألعاب (Game Characters)، معالجة الطلبات (Order Processing)، أو مشغلات الوسائط (Media Players).

# chainOfResponsibilityPros
source: You can control the order of request handling. Single Responsibility Principle. Open/Closed Principle.
ar: التحكم في ترتيب معالجة الطلبات مبدأ المسؤولية الواحدة مبدأ المفتوح/المغلق

# chainOfResponsibilityCons
source: Some requests may end up unhandled.
ar: بعض الطلبات قد لا تتم معالجتها إذا لم يتعامل معها أي معالج في السلسلة

# chainOfResponsibilityWhenToUse
source: Use when your program is expected to process different kinds of requests in various ways, but the exact types of requests and their sequences are unknown beforehand.
ar: استخدمه عندما يُتوقع من برنامجك معالجة أنواع مختلفة من الطلبات بطرق متنوعة، ولكن الأنواع الدقيقة وترتيب الطلبات غير معروف مسبقاً.

# chainOfResponsibilityBestUse
source: Middleware in web frameworks, event bubbling in UI, or sequential validation logic.
ar: الـ Middleware في أطر عمل الويب، نظام انتشار الأحداث في واجهة المستخدم (Event Bubbling)، أو سلاسل التحقق المتتالية (Sequential Validation).

# iteratorPros
source: Single Responsibility Principle. Open/Closed Principle. You can delay an iteration and continue it when needed.
ar: مبدأ المسؤولية الواحدة مبدأ المفتوح/المغلق يمكنك إيقاف واستكمال التكرار عند الحاجة

# iteratorCons
source: Applying the pattern can be an overkill if your app only works with simple collections.
ar: قد يكون مبالغاً فيه إذا كان التطبيق يعمل فقط مع مجموعات بسيطة (Simple Collections)

# iteratorWhenToUse
source: Use when your collection has a complex data structure under the hood, but you want to hide its complexity from clients.
ar: استخدمه عندما تحتوي المجموعة على هيكل بيانات معقد داخلياً، ولكنك تريد إخفاء هذا التعقيد عن المستخدمين.

# iteratorBestUse
source: Custom collection types, directory traversal, or complex data streaming.
ar: أنواع المجموعات المخصصة (Custom Collections)، التنقل في المجلدات (Directory Traversal)، أو معالجة تدفق البيانات المعقدة.

# interpreterPros
source: Easy to change and extend the grammar. Implementing the grammar is straightforward.
ar: سهولة تغيير وتوسيع قواعد اللغة (Grammar) تنفيذ القواعد بشكل مباشر وسهل الفهم

# interpreterCons
source: Maintenance becomes difficult as the number of rules in the grammar increases.
ar: تصبح الصيانة صعبة مع زيادة تعقيد وعدد قواعد اللغة

# interpreterWhenToUse
source: Use when you have a simple grammar to interpret and you can represent statements in the language as abstract syntax trees.
ar: استخدمه عندما تكون لديك لغة بسيطة تريد تفسيرها، ويمكن تمثيل جملها كأشجار تركيب نحوي (Abstract Syntax Trees).

# interpreterBestUse
source: SQL parsing, regular expressions, or mathematical expression evaluators.
ar: تحليل استعلامات SQL، معالجة التعبيرات النمطية (Regular Expressions)، أو حاسبات التعبيرات الرياضية.

# mediatorPros
source: Single Responsibility Principle. Open/Closed Principle. Reduces coupling between various components of a program.
ar: مبدأ المسؤولية الواحدة مبدأ المفتوح/المغلق يقلل من الترابط المعقد بين الأجزاء المختلفة من البرنامج

# mediatorCons
source: Over time a mediator can evolve into a God Object.
ar: بمرور الوقت، قد يتحول الوسيط إلى كائن ضخم مرتبط بكل شيء (God Object)

# mediatorWhenToUse
source: Use when it's hard to change some of the classes because they are tightly coupled to a bunch of other classes.
ar: استخدمه عندما يصعب تعديل بعض الكلاسات لأنها مرتبطة بشكل وثيق جداً مع مجموعة من الكلاسات الأخرى.

# mediatorBestUse
source: Chat application rooms, UI dialog coordination, or airline traffic control systems.
ar: غرف الدردشة (Chat Rooms)، تنسيق نوافذ الحوار في واجهة المستخدم (UI Dialog Coordination)، أو أنظمة التحكم في الحركة الجوية.

# mementoPros
source: You can produce snapshots of the object's state without violating its encapsulation. You can simplify the originator's code.
ar: حفظ حالة الكائن دون انتهاك التغليف (Encapsulation) تبسيط كود الكائن الأصلي (Originator)

# mementoCons
source: The app might consume lots of RAM if clients create mementos too often.
ar: قد يستهلك الكثير من الذاكرة (RAM) إذا تم إنشاء Snapshots بشكل متكرر جداً

# mementoWhenToUse
source: Use when you want to produce snapshots of the object's state to be able to restore a previous state of the object.
ar: استخدمه عندما تريد حفظ صور (Snapshots) لحالة الكائن لتتمكن من استعادة حالته السابقة عند الحاجة.

# mementoBestUse
source: Undo/Redo systems, game checkpoints, or configuration rollbacks.
ar: أنظمة Undo/Redo، نقاط الحفظ في الألعاب (Game Checkpoints)، أو استعادة الإعدادات السابقة (Configuration Rollbacks).

# templateMethodPros
source: You can let clients override only certain parts of a large algorithm. You can pull the duplicate code into a superclass.
ar: السماح للمستخدمين بتخصيص أجزاء محددة فقط من خوارزمية كبيرة سحب الكود المكرر إلى الكلاس الأب

# templateMethodCons
source: Some clients may be limited by the provided skeleton of an algorithm.
ar: بعض المستخدمين قد يشعرون بالتقييد بسبب الهيكل المحدد للخوارزمية

# templateMethodWhenToUse
source: Use when you want to let clients extend only particular steps of an algorithm, but not the whole algorithm or its structure.
ar: استخدمه عندما تريد السماح للمستخدمين بتوسيع خطوات محددة فقط من الخوارزمية، وليس الخوارزمية بأكملها أو هيكلها العام.

# templateMethodBestUse
source: Data processing frameworks, build scripts, or standard algorithm hooks.
ar: أطر عمل معالجة البيانات (Data Processing Frameworks)، سكربتات البناء (Build Scripts)، أو نقاط التخصيص في الخوارزميات القياسية.

# visitorPros
source: Open/Closed Principle. Single Responsibility Principle. A visitor object can accumulate some useful information while working with various objects.
ar: مبدأ المفتوح/المغلق مبدأ المسؤولية الواحدة يمكن للـ Visitor جمع معلومات مفيدة أثناء العمل مع كائنات مختلفة

# visitorCons
source: You need to update all visitors each time a class gets added to or removed from the element hierarchy.
ar: تحتاج لتحديث جميع الـ Visitors في كل مرة يتم إضافة أو حذف كلاس من التسلسل الهرمي

# visitorWhenToUse
source: Use when you need to perform an operation on all elements of a complex object structure (e.g., an object tree).
ar: استخدمه عندما تحتاج لتنفيذ عملية على جميع عناصر هيكل كائن معقد (مثل شجرة كائنات).

# visitorBestUse
source: Document exporting, code analysis tools (AST visitors), or operations on heterogeneous collections.
ar: تصدير المستندات بصيغ مختلفة، أدوات تحليل الكود (Code Analysis/AST Visitors)، أو العمليات على مجموعات غير متجانسة.

# flyweightPros
source: You can save lots of RAM, assuming your app has tons of similar objects.
ar: توفير كبير في استهلاك الذاكرة (RAM) إذا كان لديك عدد ضخم من الكائنات المتشابهة تحسين الأداء العام في الأنظمة التي تعاني من ضيق الذاكرة

# flyweightCons
source: You might be exchanging RAM for CPU cycles when some of the context data needs to be recalculated. The code becomes much more complicated.
ar: قد تضحي بالذاكرة مقابل استهلاك أكبر للمعالج (CPU) عند إعادة حساب بعض البيانات يصبح الكود أكثر تعقيداً بشكل ملحوظ

# flyweightWhenToUse
source: Use the Flyweight pattern only when your program must support a huge number of objects which barely fit into available RAM.
ar: استخدمه فقط عندما يجب أن يدعم برنامجك عدداً هائلاً من الكائنات التي بالكاد تتسع لها الذاكرة المتوفرة.

# flyweightBestUse
source: Particle systems (smoke, fire), map markers in large datasets, or text editors handling millions of characters.
ar: أنظمة الجسيمات في الألعاب (Particle Systems مثل الدخان والنار)، علامات الخرائط في مجموعات البيانات الضخمة، أو محررات النصوص التي تتعامل مع ملايين الأحرف.

source: Answer
ar: الإجابة

# basicLevel
source: Basic
ar: مبتدئ

# basicLevelDesc
source: Fundamental concepts every Flutter developer should know.
ar: مفاهيم أساسية يجب على كل مطور Flutter معرفتها.

# intermediateLevel
source: Intermediate
ar: متوسط

# intermediateLevelDesc
source: Deeper understanding of Flutter and Dart features.
ar: فهم أعمق لميزات Flutter و Dart.

# advancedLevel
source: Advanced
ar: متقدم

# advancedLevelDesc
source: Expert-level topics for senior developers.
ar: مواضيع متقدمة للمطورين الأكثر خبرة.

# expertLevel
source: Expert
ar: محترف

# expertLevelDesc
source: Expert-level topics for senior developers.
ar: مواضيع متقدمة للمطورين الأكثر خبرة.

# qWhatIsFlutter
source: What is Flutter?
ar: ما هو Flutter؟

# qWhatIsFlutterNotes
source: Flutter is an open-source UI toolkit for building natively compiled applications for mobile, web, and desktop from a single codebase. It uses the Dart programming language and provides a rich set of customizable widgets and tools for fast development.
ar: Flutter هو إطار عمل مفتوح المصدر لبناء تطبيقات يتم تجميعها بشكل أصلي (Native) للهواتف المحمولة والويب وسطح المكتب من قاعدة كود واحدة. يستخدم لغة البرمجة Dart ويوفر مجموعة غنية من العناصر (Widgets) القابلة للتخصيص وأدوات للتطوير السريع.

# qWhatIsFlutterPros
source: High performance due to native compilation. Hot reload for fast development. Single codebase for multiple platforms.
ar: أداء عالٍ بفضل التجميع الأصلي (Native Compilation) خاصية Hot Reload للتطوير السريع قاعدة كود واحدة لمنصات متعددة

# qWhatIsFlutterCons
source: Larger app size compared to some alternatives. Fewer third-party libraries. Learning Dart may be challenging for new developers.
ar: حجم التطبيق أكبر مقارنة ببعض البدائل مكتبات خارجية أقل نسبياً تعلم Dart قد يكون تحدياً للمطورين الجدد

# qWhatIsFlutterBestUse
source: Ideal for building cross-platform mobile apps with beautiful custom UI and fast development cycles.
ar: مثالي لبناء تطبيقات متعددة المنصات مع واجهة مستخدم مخصصة وجميلة ودورات تطوير سريعة.

# qWhatIsDart
source: What is Dart, and why is it used in Flutter?
ar: ما هي لغة Dart ولماذا تُستخدم في Flutter؟

# qWhatIsDartNotes
source: Dart is a modern object-oriented programming language optimized for building UI, used to develop Flutter applications. It compiles to native code for high performance and has features like sound null-safety and a rich standard library.
ar: Dart هي لغة برمجة حديثة وكائنية التوجه (Object-Oriented) مُحسَّنة لبناء واجهات المستخدم، تُستخدم لتطوير تطبيقات Flutter. تُترجَم إلى كود أصلي (Native) للحصول على أداء عالٍ، ولديها ميزات مثل الأمان من القيم الفارغة (Null Safety) ومكتبة قياسية غنية.

# qWhatIsDartPros
source: Easy to learn for developers familiar with C-style syntax. Supports both AOT and JIT compilation. Strong null-safety features.
ar: سهلة التعلم للمطورين الذين يعرفون لغات مثل C أو Java تدعم كلاً من AOT و JIT Compilation ميزات قوية للأمان من القيم الفارغة (Null Safety)

# qWhatIsDartCons
source: Smaller ecosystem compared to JavaScript. Primarily used with Flutter, limiting server-side reuse.
ar: نظام بيئي أصغر مقارنة بـ JavaScript تُستخدم بشكل رئيسي مع Flutter، مما يحد من إعادة استخدامها في الخادم (Server-Side)

# qWhatIsDartBestUse
source: Best used for Flutter app development and client-side applications where performance and developer productivity matter.
ar: الأفضل لتطوير تطبيقات Flutter والتطبيقات التي تحتاج أداءً عالياً وإنتاجية للمطور.

# qWhatAreWidgets
source: What are Widgets in Flutter?
ar: ما هي الـ Widgets في Flutter؟

# qWhatAreWidgetsNotes
source: Widgets are the basic building blocks of a Flutter app's UI. Everything you see on screen in Flutter is a Widget, which can be either stateful or stateless. Widgets describe how to display elements on the screen in a declarative manner.
ar: الـ Widgets هي اللبنات الأساسية لواجهة المستخدم في تطبيق Flutter. كل ما تراه على الشاشة في Flutter هو Widget، والذي يمكن أن يكون Stateless أو Stateful. تصف الـ Widgets كيفية عرض العناصر على الشاشة بطريقة تصريحية (Declarative).

# qWhatAreWidgetsPros
source: Highly customizable and composable. You can build complex UIs by combining simpler widgets. Flutter's hot reload works well with its widget tree.
ar: قابلة للتخصيص والتركيب بشكل كبير يمكنك بناء واجهات معقدة بدمج عناصر بسيطة خاصية Hot Reload تعمل بشكل ممتاز مع شجرة الـ Widgets

# qWhatAreWidgetsCons
source: Deep widget hierarchies can become complex. Requires understanding of widget lifecycle for effective state management.
ar: التسلسلات الهرمية العميقة للـ Widgets قد تصبح معقدة تتطلب فهم دورة حياة الـ Widget لإدارة الحالة بفعالية

# qWhatAreWidgetsBestUse
source: Use widgets for all UI components; take advantage of stateless widgets for static parts and stateful widgets for interactive parts.
ar: استخدم الـ Widgets لجميع مكونات واجهة المستخدم؛ استفد من StatelessWidget للأجزاء الثابتة و StatefulWidget للأجزاء التفاعلية.

# qStatelessVsStateful
source: What is the difference between StatelessWidget and StatefulWidget?
ar: ما الفرق بين StatelessWidget و StatefulWidget؟

# qStatelessVsStatefulNotes
source: A StatelessWidget cannot change its state once built; it's immutable. A StatefulWidget has mutable state (via a State object) that can change over time, triggering rebuilds. StatelessWidget is simpler and more performant for static content. StatefulWidget allows dynamic and interactive UI.
ar: الـ StatelessWidget لا يمكن تغيير حالته بعد البناء؛ فهو ثابت (Immutable). أما StatefulWidget فلديه حالة قابلة للتغيير (عبر كائن State) يمكن أن تتغير مع الوقت، مما يؤدي إلى إعادة البناء. StatelessWidget أبسط وأفضل أداءً للمحتوى الثابت. StatefulWidget يسمح بواجهة ديناميكية وتفاعلية.

# qStatelessVsStatefulPros
source: StatelessWidget is simpler and more performant for static content. StatefulWidget allows dynamic and interactive UI.
ar: StatelessWidget أبسط وأفضل أداءً للمحتوى الثابت StatefulWidget يسمح بواجهة ديناميكية وتفاعلية

# qStatelessVsStatefulCons
source: StatelessWidget can't update UI based on changes. StatefulWidget introduces overhead of state management and rebuilds.
ar: StatelessWidget لا يمكنه تحديث الواجهة عند التغييرات StatefulWidget يضيف عبء إدارة الحالة وإعادة البناء

# qStatelessVsStatefulBestUse
source: Use StatelessWidget for UI that doesn't change (e.g., static text), and StatefulWidget when UI needs to update (e.g., forms, animations).
ar: استخدم StatelessWidget للواجهة التي لا تتغير (مثل النص الثابت)، واستخدم StatefulWidget عندما تحتاج الواجهة للتحديث (مثل النماذج والرسوم المتحركة).

# qWhatIsKey
source: What is a Key in Flutter and why is it used?
ar: ما هو الـ Key في Flutter ولماذا يُستخدم؟

# qWhatIsKeyNotes
source: A Key is an identifier for Widgets, Elements, and SemanticsNodes. Keys preserve state and control widget identity when the widget tree changes (e.g., reordering). Using keys helps Flutter match widgets between builds.
ar: الـ Key هو معرّف للـ Widgets والـ Elements والـ SemanticsNodes. تحافظ الـ Keys على الحالة وتتحكم في هوية الـ Widget عند تغيير شجرة الـ Widgets (مثل إعادة الترتيب). استخدام الـ Keys يساعد Flutter في مطابقة الـ Widgets بين عمليات البناء.

# qWhatIsKeyPros
source: Using keys (especially UniqueKey or ValueKey) helps avoid unexpected behavior when reordering or dynamically changing lists of widgets.
ar: استخدام الـ Keys (خاصة UniqueKey أو ValueKey) يساعد في تجنب السلوك غير المتوقع عند إعادة ترتيب أو تغيير قوائم الـ Widgets ديناميكياً

# qWhatIsKeyCons
source: Often not needed unless you manage dynamic widget lists. Overusing keys can complicate the code.
ar: غالباً ليست ضرورية إلا إذا كنت تدير قوائم widgets ديناميكية الإفراط في استخدام الـ Keys قد يعقد الكود

# qWhatIsKeyBestUse
source: Use keys when you have multiple widgets of the same type and need to preserve their state when they move or change position.
ar: استخدم الـ Keys عندما يكون لديك عدة widgets من نفس النوع وتحتاج للحفاظ على حالتها عند تحركها أو تغيير موقعها.

# qHotReloadVsRestart
source: Explain the difference between Hot Reload and Hot Restart in Flutter.
ar: اشرح الفرق بين Hot Reload و Hot Restart في Flutter.

# qHotReloadVsRestartNotes
source: Hot Reload injects updated source code into a running Dart VM, preserving the app state and making UI changes visible almost instantly. Hot Restart completely restarts the app, rebuilding the widget tree and reinitializing state, which is slower than hot reload.
ar: الـ Hot Reload يضخ الكود المحدث في Dart VM الجاري، محافظاً على حالة التطبيق ويجعل تغييرات الواجهة مرئية فوراً تقريباً. أما Hot Restart فيعيد تشغيل التطبيق بالكامل، ويعيد بناء شجرة الـ Widgets ويعيد تهيئة الحالة، وهو أبطأ من Hot Reload.

# qHotReloadVsRestartPros
source: Hot Reload greatly speeds up UI development by preserving state. Hot Restart ensures full reset, useful when major changes require clean state.
ar: Hot Reload يسرع تطوير الواجهة بشكل كبير بالحفاظ على الحالة Hot Restart يضمن إعادة تعيين كاملة، مفيد عند الحاجة لحالة نظيفة

# qHotReloadVsRestartCons
source: Hot Reload may not reflect changes outside widget code or initial setup. Hot Restart is slower and loses the current state.
ar: Hot Reload قد لا يعكس التغييرات خارج كود الـ Widget أو الإعداد الأولي Hot Restart أبطأ ويفقد الحالة الحالية

# qHotReloadVsRestartBestUse
source: Use Hot Reload for quick iterations during UI development; use Hot Restart when you need to apply changes that require restarting the app.
ar: استخدم Hot Reload للتكرار السريع أثناء تطوير الواجهة؛ استخدم Hot Restart عند الحاجة لتطبيق تغييرات تتطلب إعادة تشغيل التطبيق.

# qMaterialAppScaffold
source: What is the purpose of MaterialApp and Scaffold widgets?
ar: ما هو الغرض من MaterialApp و Scaffold widgets؟

# qMaterialAppScaffoldNotes
source: MaterialApp is a convenience widget that wraps a number of widgets commonly required for Material Design applications, such as themes and navigation. Scaffold provides a framework for implementing the basic visual layout structure of Material Design (app bars, drawers, bottom sheets, etc.).
ar: MaterialApp هو widget يغلف عدداً من الـ widgets المطلوبة عادةً لتطبيقات Material Design، مثل الثيمات والتنقل. Scaffold يوفر إطاراً لتنفيذ الهيكل البصري الأساسي لـ Material Design (شريط التطبيق، الأدراج، الأوراق السفلية، إلخ).

# qMaterialAppScaffoldPros
source: MaterialApp handles app-level configurations (theme, locale, navigator). Scaffold provides standard UI elements out of the box.
ar: MaterialApp يتعامل مع إعدادات التطبيق (الثيم، اللغة، Navigator) Scaffold يوفر عناصر واجهة قياسية جاهزة للاستخدام

# qMaterialAppScaffoldCons
source: They impose Material Design. For a custom look or non-Material design, one might use WidgetsApp or a custom layout.
ar: يفرضان Material Design للمظهر المخصص أو التصميم غير Material، يمكن استخدام WidgetsApp أو تخطيط مخصص

# qMaterialAppScaffoldBestUse
source: Use MaterialApp and Scaffold when developing a Flutter app following Material Design guidelines.
ar: استخدم MaterialApp و Scaffold عند تطوير تطبيق Flutter يتبع إرشادات Material Design.

# qWidgetLifecycle
source: What is a Flutter Widget's lifecycle (StatefulWidget lifecycle)?
ar: ما هي دورة حياة Widget في Flutter (دورة حياة StatefulWidget)؟
