Repository: ahmedm-gh/oop
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: OOP Mastery
ar: إتقان البرمجة الكائنية (OOP Mastery)

source: Home
ar: الرئيسية

source: Design Patterns
ar: أنماط التصميم

source: Refactoring
ar: إعادة هيكلة الكود

source: Interview Questions
ar: أسئلة المقابلات

source: Dark Mode
ar: الوضع الداكن

source: Light Mode
ar: الوضع الفاتح

source: Language
ar: اللغة

source: Creational Patterns
ar: الأنماط الإنشائية - أنماط إنشاء الكائنات (Creational Patterns)

# creationalPatternsDesc
source: Creational patterns abstract the instantiation process. They help make a system independent of how its objects are created, composed, and represented.
ar: هذه الأنماط تساعدك في إنشاء الكائنات (Objects) بطرق مرنة ومنظمة، بحيث يكون الكود الخاص بك مستقلاً عن كيفية إنشاء هذه الكائنات.

source: Factory Method
ar: نمط المصنع (Factory Method)

# factoryMethodDesc
source: Provides an interface for creating objects in a superclass, but allows subclasses to alter the type of objects that will be created.
ar: يوفر لك طريقة مركزية لإنشاء الكائنات في الكلاس الأب، لكن يسمح للكلاسات الفرعية (Subclasses) أن تقرر نوع الكائن الذي سيتم إنشاؤه بالضبط.

source: Abstract Factory
ar: المصنع المجرد (Abstract Factory)

# abstractFactoryDesc
source: Lets you produce families of related objects without specifying their concrete classes.
ar: يسمح لك بإنشاء مجموعة من الكائنات المرتبطة ببعضها (مثل أزرار ونوافذ بنفس الستايل) دون الحاجة لتحديد الكلاسات الفعلية (Concrete Classes) لهذه الكائنات.

source: Builder
ar: نمط البناء (Builder)

# builderDesc
source: Lets you construct complex objects step by step. The pattern allows you to produce different types and representations of an object using the same construction code.
ar: يساعدك في بناء كائنات معقدة خطوة بخطوة. مفيد جداً عندما يكون لديك كائن بإعدادات كثيرة ومختلفة، ويتيح لك إنشاء أشكال مختلفة من نفس الكائن باستخدام نفس طريقة البناء.

source: Prototype
ar: نمط النسخ (Prototype)

# prototypeDesc
source: Lets you copy existing objects without making your code dependent on their classes.
ar: يتيح لك نسخ (Clone) الكائنات الموجودة بدلاً من إنشائها من الصفر، دون أن يعتمد الكود الخاص بك على تفاصيل هذه الكائنات الداخلية.

source: Singleton
ar: نمط الكائن الوحيد (Singleton)

# singletonDesc
source: Ensures that a class has only one instance, while providing a global access point to this instance.
ar: يضمن أن الكلاس سيكون له نسخة واحدة فقط (Instance واحد) في البرنامج كله، مع توفير نقطة وصول عامة لهذه النسخة من أي مكان في الكود.

source: Structural Patterns
ar: الأنماط الهيكلية - أنماط تنظيم الكائنات (Structural Patterns)

# structuralPatternsDesc
source: These patterns explain how to assemble objects and classes into larger structures while keeping these structures flexible and efficient.
ar: هذه الأنماط تشرح كيفية تجميع وربط الكائنات والكلاسات معاً لتكوين هياكل أكبر، مع الحفاظ على مرونة وكفاءة هذه الهياكل.

source: Adapter
ar: نمط المحول (Adapter)

# adapterDesc
source: Allows objects with incompatible interfaces to collaborate.
ar: يسمح لكائنات ذات واجهات (Interfaces) غير متوافقة بالعمل معاً. يعمل مثل محول الكهرباء الذي يوصل قابس بمنفذ غير متطابق معه.

source: Bridge
ar: نمط الجسر (Bridge)

# bridgeDesc
source: Lets you split a large class or a set of closely related classes into two separate hierarchies—abstraction and implementation—which can be developed independently of each other.
ar: يفصل الواجهة (Abstraction) عن التنفيذ الفعلي (Implementation)، بحيث يمكن تطوير كل منهما بشكل مستقل. مفيد عندما يكون لديك كلاس كبير يحتوي على عدة نسخ مختلفة من نفس الوظيفة.

source: Composite
ar: نمط التركيب الهرمي (Composite)

# compositeDesc
source: Lets you compose objects into tree structures and then work with these structures as if they were individual objects.
ar: يتيح لك تنظيم الكائنات في هياكل شجرية (مثل المجلدات والملفات)، ثم التعامل مع هذه الهياكل كما لو كانت كائناً واحداً فقط.

source: Decorator
ar: نمط المُغلِّف (Decorator)

# decoratorDesc
source: Lets you attach new behaviors to objects by placing these objects inside special wrapper objects that contain the behaviors.
ar: يتيح لك إضافة وظائف وسلوكيات جديدة للكائنات أثناء التشغيل (Runtime) عن طريق وضعها داخل كائنات مُغلِّفة خاصة تحتوي على هذه الوظائف الإضافية.

source: Facade
ar: نمط الواجهة المبسطة (Facade)

# facadeDesc
source: Provides a simplified interface to a library, a framework, or any other complex set of classes.
ar: يوفر واجهة بسيطة وسهلة للتعامل مع مكتبة أو نظام معقد يحتوي على الكثير من الكلاسات والوظائف المعقدة.

source: Flyweight
ar: نمط توفير الذاكرة (Flyweight)

# flyweightDesc
source: Lets you fit more objects into the available amount of RAM by sharing common parts of state between multiple objects instead of keeping all of the data in each object.
ar: يوفر استهلاك الذاكرة (RAM) من خلال مشاركة الأجزاء المتشابهة بين الكائنات بدلاً من تخزين جميع البيانات في كل كائن على حدة. مفيد عندما يكون لديك آلاف الكائنات المتشابهة.

source: Proxy
ar: نمط الوكيل (Proxy)

# proxyDesc
source: Lets you provide a substitute or placeholder for another object. A proxy controls access to the original object, allowing you to perform something either before or after the request gets through to the original object.
ar: يوفر كائن بديل أو وسيط للكائن الأصلي. يتحكم هذا الوكيل في الوصول للكائن الأصلي، مما يسمح لك بتنفيذ عمليات إضافية قبل أو بعد الوصول إليه (مثل التحقق من الصلاحيات أو التخزين المؤقت).

source: Behavioral Patterns
ar: الأنماط السلوكية - أنماط التواصل بين الكائنات (Behavioral Patterns)

# behavioralPatternsDesc
source: Behavioral patterns are concerned with algorithms and the assignment of responsibilities between objects.
ar: تهتم هذه الأنماط بكيفية تواصل وتفاعل الكائنات مع بعضها البعض، وتوزيع المسؤوليات بينها.

source: Chain of Responsibility
ar: نمط سلسلة المسؤولية (Chain of Responsibility)

# chainOfResponsibilityDesc
source: Lets you pass requests along a chain of handlers. Upon receiving a request, each handler decides either to process the request or to pass it to the next handler in the chain.
ar: يتيح لك تمرير الطلب على طول سلسلة من الكائنات المعالجة. كل كائن في السلسلة يقرر إما معالجة الطلب بنفسه أو تمريره للكائن التالي في السلسلة.

source: Command
ar: نمط الأمر (Command)

# commandDesc
source: Turns a request into a stand-alone object that contains all information about the request. This transformation lets you pass requests as a method arguments, delay or queue a request's execution, and support undoable operations.
ar: يحول الطلب أو العملية إلى كائن مستقل يحتوي على جميع المعلومات عن هذا الطلب. هذا يسمح لك بتمرير الطلبات كمعاملات (Parameters)، وتأخير تنفيذها، أو عمل Undo/Redo.

source: Iterator
ar: نمط المكرر (Iterator)

# iteratorDesc
source: Lets you traverse elements of a collection without exposing its underlying representation (list, stack, tree, etc.).
ar: يتيح لك المرور على عناصر مجموعة ما (Collection) بدون الحاجة لمعرفة تفاصيل تركيبها الداخلي (سواء كانت List أو Stack أو Tree).

source: Interpreter
ar: نمط المفسر (Interpreter)

# interpreterDesc
source: Given a language, defines a representation for its grammar along with an interpreter that uses the representation to interpret sentences in the language.
ar: يُستخدم لتفسير لغة أو قواعد محددة (Grammar). يحدد تمثيلاً لقواعد اللغة مع مفسر يستخدم هذا التمثيل لتنفيذ الجمل في هذه اللغة.

source: Mediator
ar: نمط الوسيط (Mediator)

# mediatorDesc
source: Lets you reduce chaotic dependencies between objects. The pattern restricts direct communications between the objects and forces them to collaborate only via a mediator object.
ar: يقلل من التعقيد والترابط الفوضوي بين الكائنات. يمنع الكائنات من الاتصال المباشر ببعضها، ويجبرها على التواصل فقط من خلال كائن وسيط مركزي.

source: Memento
ar: نمط حفظ الحالة (Memento)

# mementoDesc
source: Lets you save and restore the previous state of an object without revealing the details of its implementation.
ar: يتيح لك حفظ واستعادة الحالة السابقة لكائن ما (Snapshot) دون الكشف عن تفاصيل تركيبه الداخلي. مفيد لعمل Undo/Redo.

source: Observer
ar: نمط المراقب (Observer)

# observerDesc
source: Lets you define a subscription mechanism to notify multiple objects about any events that happen to the object they're observing.
ar: يتيح لك إنشاء نظام اشتراكات (Subscription) لإخطار عدة كائنات تلقائياً عند حدوث تغيير في الكائن الذي يراقبونه. مثل زر الاشتراك في اليوتيوب.

source: State
ar: نمط الحالة (State)

# stateDesc
source: Lets an object alter its behavior when its internal state changes. It appears as if the object changed its class.
ar: يسمح للكائن بتغيير سلوكه تماماً عندما تتغير حالته الداخلية (State). يبدو الأمر كأن الكائن قد تحول إلى كلاس مختلف تماماً.

source: Strategy
ar: نمط الاستراتيجية (Strategy)

# strategyDesc
source: Lets you define a family of algorithms, put each of them into a separate class, and make their objects interchangeable.
ar: يتيح لك تعريف مجموعة من الخوارزميات (Algorithms) المختلفة، ووضع كل واحدة في كلاس منفصل، بحيث يمكن تبديلها واستخدامها بشكل تبادلي أثناء التشغيل.

source: Template Method
ar: نمط القالب (Template Method)

# templateMethodDesc
source: Defines the skeleton of an algorithm in the superclass but lets subclasses override specific steps of the algorithm without changing its structure.
ar: يحدد الهيكل العام للخوارزمية في الكلاس الأب، لكن يترك للكلاسات الفرعية حرية تخصيص بعض خطوات محددة من الخوارزمية دون تغيير هيكلها العام.

source: Visitor
ar: نمط الزائر (Visitor)

# visitorDesc
source: Lets you separate algorithms from the objects on which they operate.
ar: يتيح لك فصل الخوارزميات والعمليات عن الكائنات التي تعمل عليها. مفيد عندما تريد تنفيذ عمليات مختلفة على مجموعة من الكائنات دون تعديل هذه الكائنات نفسها.

source: Refactoring Categories
ar: أقسام إعادة هيكلة الكود (Refactoring)

source: Composing Methods
ar: تنظيم الدوال (Composing Methods)

# composingMethodsDesc
source: Much of refactoring is devoted to correctly composing methods. In most cases, excessively long methods are the root of all evil.
ar: جزء كبير من إعادة الهيكلة يركز على تنظيم الدوال (Methods/Functions) بشكل صحيح. في معظم الحالات، الدوال الطويلة جداً هي السبب الرئيسي للمشاكل في الكود.

source: Moving Features
ar: نقل الوظائف بين الكلاسات (Moving Features)

# movingFeaturesDesc
source: These techniques show how to safely move functionality between classes, create new classes, and hide implementation details.
ar: هذه التقنيات توضح كيفية نقل الدوال والخصائص بأمان بين الكلاسات المختلفة، وإنشاء كلاسات جديدة، وإخفاء التفاصيل الداخلية (Encapsulation).

source: Organizing Data
ar: تنظيم البيانات (Organizing Data)

# organizingDataDesc
source: These techniques help with data handling, replacing primitives with rich class functionality.
ar: تساعدك هذه التقنيات في التعامل الأفضل مع البيانات، واستبدال المتغيرات البسيطة (Primitives مثل String, int) بكائنات وكلاسات أكثر قوة ومرونة.

source: Simplifying Conditionals
ar: تبسيط الشروط (Simplifying Conditionals)

# simplifyingConditionalsDesc
source: Conditionals have a tendency to become more complex in logic over time, and these techniques help combat that.
ar: الشروط (if/else/switch) تميل إلى أن تصبح معقدة ومتشابكة بمرور الوقت. هذه التقنيات تساعدك في جعلها أبسط وأسهل للفهم.

source: Simplifying Method Calls
ar: تبسيط استدعاء الدوال (Simplifying Method Calls)

# simplifyingMethodCallsDesc
source: These techniques make method calls simpler and easier to understand.
ar: هذه التقنيات تجعل طريقة استدعاء واستخدام الدوال أبسط وأوضح وأسهل في الفهم.

source: Generalization
ar: التعميم والوراثة (Generalization)

# generalizationDesc
source: Generalization is primarily about moving functionality along the class inheritance hierarchy.
ar: يتعلق بشكل أساسي بنقل الوظائف والخصائص صعوداً أو نزولاً في التسلسل الهرمي للوراثة (Inheritance Hierarchy) بين الكلاسات.

source: Notes
ar: ملاحظات

source: Details
ar: التفاصيل

# example
source: Dart Example
ar: مثال بلغة Dart

source: Good Example
ar: مثال جيد ✓

source: Bad Example
ar: مثال سيء ✗

source: See More
ar: عرض المزيد

source: Reference
ar: المرجع

source: References
ar: المراجع

source: Pros
ar: المميزات

source: Cons
ar: العيوب

source: When to Use
ar: متى تستخدمه؟

# bestUse
source: Best Use Cases
ar: أفضل حالات الاستخدام

source: Close
ar: إغلاق

source: Extract Method
ar: استخراج دالة منفصلة (Extract Method)

source: Inline Method
ar: دمج الدالة في المكان المستدعى منه (Inline Method)

source: Extract Variable
ar: استخراج متغير منفصل (Extract Variable)

source: Move Method
ar: نقل الدالة لكلاس آخر (Move Method)

source: Move Field
ar: نقل الخاصية لكلاس آخر (Move Field)

source: Extract Class
ar: استخراج كلاس جديد منفصل (Extract Class)

source: Self Encapsulate Field
ar: تغليف الخاصية بـ Getters/Setters (Self Encapsulate Field)

source: Replace Data Value with Object
ar: استبدال المتغير البسيط بكائن (Replace Data Value with Object)

# refactoringTip
source: This technique helps simplify code structure and improve maintainability.
ar: هذه التقنية تساعد في تبسيط بنية الكود وتحسين سهولة صيانته وتطويره.

# copied
source: Copied to clipboard!
ar: تم النسخ إلى الحافظة!

# singletonNote
source: Singletons should have a private constructor and a static instance accessor.
ar: يجب أن يحتوي نمط Singleton على Constructor خاص (Private) ونقطة وصول ثابتة (Static) للنسخة الوحيدة.

# factoryMethodNote
source: Avoid 'if-else' ladders for object creation; use sub-classes to decide the concrete type.
ar: تجنب استخدام سلسلة if-else الطويلة لإنشاء الكائنات؛ بدلاً من ذلك، استخدم الكلاسات الفرعية (Subclasses) لتحديد النوع الفعلي للكائن.

# builderNote
source: Builders solve the 'Telescoping Constructor' problem and provide readable code.
ar: نمط Builder يحل مشكلة 'الـ Constructor الطويل' الذي يحتوي على عدد كبير جداً من الـ Parameters، ويوفر كوداً سهل القراءة والفهم.

# singletonPros
source: Controlled access to the sole instance. Reduced name space (avoiding global variables). Permits refinement of operations and representation via subclassing. Permits a variable number of instances if logic changes.
ar: التحكم الكامل في الوصول للنسخة الوحيدة من الكائن تجنب استخدام المتغيرات العامة (Global Variables) وتقليل التعارضات يسمح بتحسين وتطوير الكلاس من خلال الوراثة (Subclassing) يمكن تعديله لاحقاً للسماح بعدة نسخ إذا تغيرت المتطلبات

# singletonCons
source: Violates Single Responsibility Principle. Can mask bad design where components know too much about each other. Requires special handling in multi-threaded environments. Difficult to unit test due to global state.
ar: ينتهك مبدأ المسؤولية الواحدة (Single Responsibility Principle) لأنه يتحكم في إنشائه بنفسه قد يخفي تصميماً سيئاً حيث تعرف الأجزاء المختلفة من البرنامج الكثير عن بعضها يحتاج معالجة خاصة في البيئات متعددة الخيوط (Multi-threading) صعب في الاختبار (Unit Testing) بسبب الحالة العامة (Global State)

# singletonWhenToUse
source: Use when a class should have exactly one instance available to all clients (e.g., a database object or a file system manager).
ar: استخدمه عندما يجب أن يكون لديك نسخة واحدة فقط من كلاس معين متاحة لجميع أجزاء البرنامج (مثل الاتصال بقاعدة البيانات أو نظام إدارة الملفات).

# singletonBestUse
source: Logging services, database connection pools, configuration managers, or hardware access.
ar: خدمات التسجيل والـ Logging، إدارة الاتصالات بقاعدة البيانات (Connection Pools)، إدارة الإعدادات (Settings Manager)، أو التحكم في الأجهزة.

# factoryMethodPros
source: Avoids tight coupling between the creator and the concrete products. Single Responsibility Principle: You can move the product creation code into one place. Open/Closed Principle: You can introduce new product types without breaking client code.
ar: يتجنب الارتباط الشديد (Tight Coupling) بين الكود المُنشئ للكائنات والكائنات نفسها مبدأ المسؤولية الواحدة: كل كود إنشاء الكائنات في مكان واحد مبدأ المفتوح/المغلق: يمكنك إضافة أنواع جديدة من الكائنات دون تعديل الكود الموجود

# factoryMethodCons
source: The code may become more complicated since you need to introduce a lot of new subclasses to implement the pattern.
ar: قد يصبح الكود أكثر تعقيداً لأنك تحتاج لإنشاء العديد من الكلاسات الفرعية الجديدة لتطبيق هذا النمط

# factoryMethodWhenToUse
source: Use when you don't know beforehand the exact types and dependencies of the objects your code should work with.
ar: استخدمه عندما لا تعرف مسبقاً الأنواع الدقيقة للكائنات التي سيحتاجها الكود الخاص بك، أو عندما يتم تحديد النوع في وقت التشغيل (Runtime).

# factoryMethodBestUse
source: UI frameworks providing hooks for creating different components, or any system where the exact type is determined at runtime.
ar: أطر عمل واجهة المستخدم (UI Frameworks)، أو أي نظام يتم فيه تحديد نوع الكائن الدقيق أثناء تشغيل البرنامج.

# abstractFactoryPros
source: Guarantees compatibility of products. Avoids tight coupling. Single Responsibility Principle. Open/Closed Principle.
ar: يضمن توافق الكائنات المُنشأة مع بعضها (مثل أزرار ونوافذ بنفس الستايل) يتجنب الارتباط الشديد بين الكود والكائنات مبدأ المسؤولية الواحدة مبدأ المفتوح/المغلق

# abstractFactoryCons
source: Code complexity increases with many new interfaces and classes.
ar: يزيد من تعقيد الكود بسبب إضافة العديد من الـ Interfaces والكلاسات الجديدة

# abstractFactoryWhenToUse
source: Use when your code needs to work with various families of related products, but you don't want it to depend on the concrete classes of those products.
ar: استخدمه عندما يحتاج الكود للتعامل مع مجموعات مختلفة من الكائنات المرتبطة (Families)، ولكن دون الاعتماد على الكلاسات الفعلية لهذه الكائنات.

# abstractFactoryBestUse
source: Cross-platform UI toolkits (Windows/Android/iOS styles), or multiple theme support.
ar: مكتبات واجهة المستخدم عبر المنصات المختلفة (Windows/Android/iOS)، أو دعم عدة ثيمات (Themes) مختلفة في التطبيق.

# builderPros
source: Construct objects step-by-step. Reuse the same construction code for various representations. Single Responsibility Principle (isolated complex construction).
ar: بناء الكائنات خطوة بخطوة بطريقة واضحة إعادة استخدام نفس كود البناء لإنشاء أشكال مختلفة من الكائن مبدأ المسؤولية الواحدة (عزل كود البناء المعقد في مكان واحد)

# builderCons
source: Increased overall complexity due to multiple new classes.
ar: يزيد من التعقيد العام للكود بسبب إضافة كلاسات جديدة متعددة

# builderWhenToUse
source: Use to get rid of a 'telescoping constructor' (too many parameters) or when you need different representations of an object.
ar: استخدمه للتخلص من الـ Constructor الذي يحتوي على عدد كبير من الـ Parameters، أو عندما تحتاج لإنشاء أشكال مختلفة من نفس الكائن.

# builderBestUse
source: Complex configurations, Document builders (HTML/JSON/PDF), or complex data models.
ar: الإعدادات المعقدة (Configuration)، بناء المستندات (HTML/JSON/PDF Builders)، أو نماذج البيانات المعقدة (Complex Data Models).

# prototypePros
source: Clone objects without coupling to concrete classes. Get rid of repeated initialization code. Produce complex objects more conveniently.
ar: نسخ الكائنات دون الارتباط بالكلاسات الفعلية (Concrete Classes) التخلص من كود التهيئة المتكرر (Initialization Code) إنشاء كائنات معقدة بشكل أسرع وأسهل

# prototypeCons
source: Cloning complex objects with circular references might be tricky.
ar: نسخ الكائنات المعقدة التي تحتوي على مراجع دائرية (Circular References) قد يكون صعباً

# prototypeWhenToUse
source: Use when the cost of creating a new object is higher than cloning an existing one.
ar: استخدمه عندما تكون تكلفة إنشاء كائن جديد من الصفر أعلى من نسخ كائن موجود بالفعل.

# prototypeBestUse
source: Game engines (spawning units), Graphics software, or Object caching.
ar: محركات الألعاب (إنشاء وحدات متشابهة)، برامج الجرافيك والتصميم، أو التخزين المؤقت للكائنات (Object Caching).

# adapterPros
source: Single Responsibility Principle (separable interface/data conversion). Open/Closed Principle (new adapters without breaking client code).
ar: مبدأ المسؤولية الواحدة (فصل كود تحويل الواجهة عن باقي الكود) مبدأ المفتوح/المغلق (إضافة محولات جديدة دون تعديل كود العميل)

# adapterCons
source: Over-engineering (code complexity increases).
ar: زيادة في تعقيد الكود بسبب إضافة طبقات جديدة

# adapterWhenToUse
source: Use when you want to use an existing class, but its interface isn't compatible with the rest of your code.
ar: استخدمه عندما تريد استخدام كلاس موجود بالفعل، لكن واجهته (Interface) غير متوافقة مع باقي الكود الخاص بك.

# adapterBestUse
source: Integrating 3rd party libraries, Legacy code migration, or XML/JSON data mapping.
ar: دمج مكتبات الطرف الثالث (3rd Party Libraries)، ترحيل الكود القديم (Legacy Code Migration)، أو تحويل بيانات XML/JSON.

# bridgePros
source: Decouples abstraction from implementation. Platform-independent code. Open/Closed Principle.
ar: فصل الواجهة (Abstraction) عن التنفيذ الفعلي (Implementation) كتابة كود مستقل عن المنصة (Platform-Independent) مبدأ المفتوح/المغلق

# bridgeCons
source: Might make code more complicated in highly cohesive classes.
ar: قد يزيد من تعقيد الكود في حالة الكلاسات البسيطة والمترابطة بشكل جيد

# bridgeWhenToUse
source: Use when you want to divide and organize a monolithic class that has several variants of some functionality.
ar: استخدمه عندما تريد تقسيم كلاس كبير ومعقد يحتوي على عدة نسخ مختلفة من نفس الوظيفة إلى أجزاء منفصلة يمكن تطويرها بشكل مستقل.

# bridgeBestUse
source: GUI frameworks, Cross-platform drivers, or Graphics libraries.
ar: أطر عمل الواجهات الرسومية (GUI Frameworks)، تطوير برامج تعمل على منصات مختلفة (Cross-Platform Drivers)، أو مكتبات الجرافيك.

# compositePros
source: Work with complex tree structures conveniently. Open/Closed Principle.
ar: التعامل مع الهياكل الشجرية المعقدة بسهولة مبدأ المفتوح/المغلق

# compositeCons
source: Difficult to provide a common interface for classes whose functionality differs too much.
ar: من الصعب توفير واجهة موحدة للكلاسات التي تختلف وظائفها بشكل كبير

# compositeWhenToUse
source: Use when you have to implement a tree-like object structure.
ar: استخدمه عندما تحتاج لتمثيل هيكل هرمي يشبه الشجرة (Tree-like Structure) مثل نظام الملفات والمجلدات.

# compositeBestUse
source: File systems, UI component hierarchies (widgets), or XML structures.
ar: أنظمة الملفات (File Systems)، التسلسل الهرمي لمكونات واجهة المستخدم (UI Component Hierarchies)، أو هياكل XML/HTML.

# decoratorPros
source: Extend object's behavior without making a new subclass. Add or remove responsibilities from an object at runtime. Combine several behaviors by wrapping an object into multiple decorators.
ar: إضافة وظائف جديدة للكائن دون إنشاء كلاس فرعي جديد إضافة أو إزالة المسؤوليات من الكائن أثناء التشغيل (Runtime) دمج عدة وظائف بتغليف الكائن في عدة Decorators

# decoratorCons
source: Difficult to remove a specific wrapper from the wrappers stack. Hard to implement a decorator in such a way that its behavior doesn't depend on the order in the decorators stack.
ar: من الصعب إزالة Wrapper معين من مجموعة Wrappers متداخلة من الصعب التحكم في سلوك الـ Decorator بحيث لا يعتمد على ترتيبه في مكدس الـ Decorators

# decoratorWhenToUse
source: Use when you need to be able to assign extra behaviors to objects at runtime without breaking the code that uses these objects.
ar: استخدمه عندما تحتاج لإضافة سلوكيات ووظائف إضافية للكائنات أثناء التشغيل دون تعديل الكود الذي يستخدم هذه الكائنات.

# decoratorBestUse
source: Streams (IO), Notification systems, or UI component wrappers (borders/scrollbars).
ar: معالجة الملفات (I/O Streams)، أنظمة الإشعارات (Notification Systems)، أو إضافة مكونات لواجهة المستخدم (Borders/Scrollbars).

# facadePros
source: Isolate your code from the complexity of a subsystem.
ar: عزل الكود الخاص بك عن تعقيدات النظام الفرعي الداخلية

# facadeCons
source: A facade can become a god object coupled to all classes of an app.
ar: قد تصبح الواجهة (Facade) كائناً ضخماً مرتبطاً بجميع أجزاء البرنامج (God Object)

# facadeWhenToUse
source: Use when you need to have a limited but straightforward interface to a complex subsystem.
ar: استخدمه عندما تحتاج لواجهة بسيطة ومباشرة للتعامل مع نظام فرعي معقد يحتوي على العديد من الكلاسات والدوال.

# facadeBestUse
source: Complex 3rd party SDKs, Audio/Video processing libraries, or Multi-service API clients.
ar: مكتبات SDK المعقدة للطرف الثالث، مكتبات معالجة الصوت والفيديو، أو التعامل مع عدة APIs في مكان واحد.
